_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 34, 34, 3)         0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 32, 64)        1792
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 64)        0
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 34, 34, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 64)        36928
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 64)        0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 16, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 16, 64)        0
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 18, 18, 64)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 128)       73856
_________________________________________________________________
activation_3 (Activation)    (None, 16, 16, 128)       0
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 18, 18, 128)       0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 128)       147584
_________________________________________________________________
activation_4 (Activation)    (None, 16, 16, 128)       0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 128)         0
_________________________________________________________________
dropout_2 (Dropout)          (None, 8, 8, 128)         0
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 10, 10, 128)       0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 256)         295168
_________________________________________________________________
activation_5 (Activation)    (None, 8, 8, 256)         0
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 10, 10, 256)       0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 256)         590080
_________________________________________________________________
activation_6 (Activation)    (None, 8, 8, 256)         0
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 10, 10, 256)       0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 8, 8, 256)         590080
_________________________________________________________________
activation_7 (Activation)    (None, 8, 8, 256)         0
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 10, 10, 256)       0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 8, 256)         590080
_________________________________________________________________
activation_8 (Activation)    (None, 8, 8, 256)         0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 256)         0
_________________________________________________________________
dropout_3 (Dropout)          (None, 4, 4, 256)         0
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 2, 2, 1024)        2360320
_________________________________________________________________
activation_9 (Activation)    (None, 2, 2, 1024)        0
_________________________________________________________________
dropout_4 (Dropout)          (None, 2, 2, 1024)        0
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 2, 2, 1024)        1049600
_________________________________________________________________
activation_10 (Activation)   (None, 2, 2, 1024)        0
_________________________________________________________________
dropout_5 (Dropout)          (None, 2, 2, 1024)        0
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 4, 4, 1024)        0
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 2, 2, 1024)        9438208
_________________________________________________________________
flatten_1 (Flatten)          (None, 4096)              0
_________________________________________________________________
dense_1 (Dense)              (None, 512)               2097664
_________________________________________________________________
activation_11 (Activation)   (None, 512)               0
_________________________________________________________________
dropout_6 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 1539
_________________________________________________________________
activation_12 (Activation)   (None, 3)                 0
=================================================================
Total params: 17,272,899
Trainable params: 17,272,899
Non-trainable params: 0
_________________________________________________________________
